Makro/Pruebas/Prueba 4.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:OnlineGeneration>
         <!--Optional:-->
         <tem:ruc>900059238</tem:ruc>
         <!--Optional:-->
         <tem:Login/>
         <!--Optional:-->
         <tem:clave>88833C6E-AD43-4E7D-9A9F-132199692827</tem:clave>
         <!--Optional:-->
         <tem:docTxt>EN|01|F|SETT|13|2022-02-04|18:09:00|COP||1|31|900059238|MAKRO|MAKRO SUPERMAYORISTA S.A.S|23001|||MONTERIA|23||Cra.  14  No.  48 A 42 |CO|48|2|13|1065012872|MARIANELA GANEM RODRIGUEZ|MARIANELA GANEM RODRIGUEZ||||||MONTERIA|CL 24  6-82   EDROSA SOFA AP 4|CO|49|174863.29|174863.29|195550.00|0.00|0.00|0.00|195550.00
ENEX|UBL 2.1|10|||||||2022-02-04||18:09:00||4690;4649;4711;4731|es|es|5|23001|MONTERIA|CORDOBA|23|Cra.  14  No.  48 A 42 |CO|Colombia||13|||23001|MONTERIA|CORDOBA|23|CL 24  6-82   EDROSA SOFA AP 4|CO|Colombia||13|15|16FD|01552666|23|Colombia|23001|CORDOBA|Colombia|23|111711|111711
RS|2022-02-17|2028-02-17|SETT|1|1000000||1702202246542
DE|1|120869|KGM|0.81|3100.00|2511.00||0.00||false
DEDI|ZANAHORIA kg
DEDI|2511.00
DEDIEX||999|1|||
DEIM|0.00|2511.00|0.00|0.00|01|IVA||KGM|0.00
DE|2|115995|PA|1.00|16300.00|16300.00||0.00||false
DEDI|PAPA PASTUSA LAVADA PQ 2.5kg
DEDI|16300.00
DEDIEX||999|1|||
DEIM|0.00|16300.00|0.00|0.00|01|IVA||PA|0.00
DE|3|128588|C62|1.00|8823.53|8823.53||0.00||false
DEDI|SALSA SOYA SAKURA 500ml
DEDI|10500.00
DEDIEX||999|1|||
DEIM|1676.47|8823.53|1676.47|19.00|01|IVA||C62|1676.47
DE|4|119851|C62|1.00|13193.28|13193.28||0.00||false
DEDI|ENJUAGUE BUC LISTERINE C-MIN500ml
DEDI|15700.00
DEDIEX||999|1|||
DEIM|2506.72|13193.28|2506.72|19.00|01|IVA||C62|2506.72
DE|5|116101|C62|1.00|7100.00|7100.00||0.00||false
DEDI|KIT CIRUELA NACIONAL ROJA 700g
DEDI|7100.00
DEDIEX||999|1|||
DEIM|0.00|7100.00|0.00|0.00|01|IVA||C62|0.00
DE|6|101902|CH|1.00|11680.67|11680.67||0.00||false
DEDI|SALSA TOMATE HEINZ PET 1077g
DEDI|13900.00
DEDIEX||999|1|||
DEIM|2219.33|11680.67|2219.33|19.00|01|IVA||CH|2219.33
DE|7|132843|C62|4.00|672.27|2352.95||0.00||false
DEDI|GALLETAS MORENITAS NESTLE 23.4g
DEDI|2800.00
DEDIEX||999|1|||
DEIM|447.06|2352.95|447.06|19.00|01|IVA||C62|111.77
DEDR|false|336.13|12.50|||2689.08
DE|8|123972|KGM|0.54|12150.00|6561.00||0.00||false
DEDI|MANZANA IMPORTADA ROJA kg
DEDI|6561.00
DEDIEX||999|1|||
DEIM|0.00|6561.00|0.00|0.00|01|IVA||KGM|0.00
DE|9|123973|KGM|0.70|13300.71|9377.00||0.00||false
DEDI|MANZANA IMPORTADA VERDE kg
DEDI|9377.00
DEDIEX||999|1|||
DEIM|0.00|9377.00|0.00|0.00|01|IVA||KGM|0.00
DE|10|133027|CH|1.00|9831.93|9831.93||0.00||false
DEDI|PLETA HLADO TOSH SURTIDA 450gEN6u
DEDI|11700.00
DEDIEX||999|1|||
DEIM|1868.07|9831.93|1868.07|19.00|01|IVA||CH|1868.07
DE|11|122373|C62|1.00|8823.53|8823.53||0.00||false
DEDI|CEREAL FROOT LOOPS 315g
DEDI|10500.00
DEDIEX||999|1|||
DEIM|1676.47|8823.53|1676.47|19.00|01|IVA||C62|1676.47
DE|12|115041|PA|3.00|18319.33|53194.11||0.00||false
DEDI|TOALLAS HUMEDAS ARO BEBE 100uX3pq
DEDI|63301.00
DEDIEX||999|1|||
DEIM|10106.88|53194.11|10106.88|19.00|01|IVA||PA|3368.96
DEDR|false|1763.87|3.21|||54957.98
DE|13|688077|57|1.00|17150.00|17150.00||0.00||false
DEDI|LIMON TAHITI MALLA 2kg
DEDI|17150.00
DEDIEX||999|1|||
DEIM|0.00|17150.00|0.00|0.00|01|IVA||57|0.00
DE|14|126653|C62|10.00|500.00|4250.00||0.00||false
DEDI|PAN ROLLO ARO 53g
DEDI|4250.00
DEDIEX||999|1|||
DEIM|0.00|4250.00|0.00|0.00|01|IVA||C62|0.00
DEDR|false|750.00|15.00|||5000.00
DE|15|988117|BG|1.00|3714.29|3714.29||0.00||false
DEDI|PASTA COMARRICO TORNILLO 1000g
DEDI|3900.00
DEDIEX||999|1|||
DEIM|185.71|3714.29|185.71|5.00|01|IVA||BG|185.71
DIT|20687.00
DI||63249.00|0.00|0.00|01|0.00|IVA||
DI||107900.00|20501.00|19.00|01|20501.00|IVA||
DI||3714.00|186.00|5.00|01|186.00|IVA||
FP|1|48|2022-02-04|2216017565176
PE|Plantilla|T01_MBS.jasper
PE|CodigoBarras|220354901812010380146
PE|PPLTienda|ST16
PE|PPLCaja|1
PE|prom|0
PE|zona|N/A
PE|idInterno|1 2022035490
PE|CentroDistribucion|MAKRO MONTERIA
PE|DirCentroDistribucion|Cra.  14  No.  48 A 42 
PE|TelCentroDistribucion|N/A
PE|CorreoDist|
PE|PasaporteCliente|16-213333
PE|BarrioCliente|MONTERIA
PE|TelefonoCliente|N/A
PE|vrPuntosCMR|0.00
PE|vrEfectivo|0.00
PE|vrTdebito|0.00
PE|vrCheque|0.00
PE|vrChequePost|0.00
PE|vrBonos|0.00
PE|vrTcredito|195550.00
PE|vrTprivada|0.00
PE|vrNotaCredito|0.00
PE|vrCreditoDirecto|0.00
PE|vrDonacion|0.00
PE|vrCambio|0.00
PE|Caja|1 38
PE|TotalArticulos|29
PE|TextoFecha|04-02-2022     18:12     1601 2022035490
PES|CentroDist
PESD|1|MAKRO MONTERIA
PESD|2|Cra.  14  No.  48 A 42 
PES|ResolucionesFactura
PESD|1|AGENTE RETENEDOR IVA RES.00812 30/1/2006
PESD|2|REG.COMUN GRAN CONTRIB Res.9061 Dic/2020
PESD|3|AUTORETENEDORES DEL IMPUESTO DE RENTA SEGUN RESOL No 1524 DE FEB 20 DE 2006
PES|Regimen
PESD|1|REG.COMUN GRAN CONTRIB Res.9061 Dic/2020
PESD|2| AUTORETENEDORES DEL IMPUESTO DE RENTA  
PESD|3| SEGUN RESOL No 1524 DE FEB 20 DE 2006  
PESD|4|        AGENTE RETENEDOR DE IVA         
PESD|5|      RESOLUCION 00812 30/01/2006       
PESD|6|
PESD|7|
PESD|8|
PES|CambioMercancia
PESD|1|(*)BIENES EXENTOS - DECRETO 417 DE 2020       CAMBIOS DENTRO DE LOS 7 DIAS HABILES A   PARTIR DE LA COMPRA,PRESENTA LA FACTURA 
PES|Falabella
PESD|1|Gracias por tu visita
PESD|2|
PESD|3|
CTE||||dte_9000592385@dte.paperless.com.co|
CTR|||||
TRE|O-13;O-15|IVA|01
TRR|R-99-PN|IVA|01
         </tem:docTxt>
         <!--Optional:-->
         <tem:tipoFoliacion>1</tem:tipoFoliacion>
         <!--Optional:-->
         <tem:tipoRetorno>5</tem:tipoRetorno>
      </tem:OnlineGeneration>
   </soapenv:Body>
</soapenv:Envelope>